eventro/app/controllers/application_controller.rb

  def require_token
    token = params.require(:auth_token)
    @current_user = User.find_by(auth_token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "TgAuFvd1PD6kxYekLoAkgf72"], ["LIMIT", 1]]

  def requireO_token
    token = params.require(:authentication_token)
    @current_Org = Organizer.find_by(authentication_token: token)
---
SELECT  "organizers".* FROM "organizers" WHERE "organizers"."authentication_token" = $1 LIMIT $2  [["authentication_token", "isxsp6d3vutsgV59U2vNiGpF"], ["LIMIT", 1]]