eventro/app/controllers/application_controller.rb

SELECT  "organizers".* FROM "organizers" WHERE "organizers"."auth_token" = $1 LIMIT $2  [["auth_token", "isxsp6d3vutsgV59U2vNiGpF"], ["LIMIT", 1]]
---
  def requireO_token
    token = params.require(:auth_token)
    @current_org = Organizer.find_by(auth_token: token)