eventro/app/controllers/attendees_controller.rb

  def create
    @attend = @current_user.attendees.create(attendee_params)
---
INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2019-02-05 09:18:38.197328"], ["updated_at", "2019-02-05 09:18:38.197328"]]

  def destroy
    # if @attendee.user_id == @current_user.id
    @attendee.destroy
---
DELETE FROM "attendees" WHERE "attendees"."id" = $1  [["id", 2]]

  def count
    @count = @event.attendees.count
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."event_id" = $1  [["event_id", 1]]

  def set_attendee
    # byebug
    @event = Event.find(params[:event_id])
    @attendee = Attendee.find_by({user_id: @current_user.id, event_id: @event.id})
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = $1 AND "attendees"."event_id" = $2 LIMIT $3  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]