eventro/app/controllers/comments_controller.rb

  def create
    @comment = @current_user.comments.create(comment_params)
---
INSERT INTO "comments" ("comment", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "{}"], ["user_id", 2], ["event_id", 1], ["created_at", "2019-02-04 17:39:45.704809"], ["updated_at", "2019-02-04 17:39:45.704809"]]

  def set_comment
    @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 1]]