eventro/app/controllers/event_images_controller.rb

SELECT "event_images".* FROM "event_images" WHERE "event_images"."event_id" = $1  [["event_id", 1]]
---
      def index
       @images = EventImage.where(:event_id => @event).all

INSERT INTO "event_images" ("image", "event_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "{}"], ["event_id", 1], ["created_at", "2019-02-05 08:40:53.082460"], ["updated_at", "2019-02-05 08:40:53.082460"], ["user_id", 2]]
---
      def create
        @image = @event.event_images.create(image_params)