eventro/app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def all_events
    @events = Event.all

UPDATE "events" SET "name" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["name", "event!!3"], ["updated_at", "2019-02-06 06:18:12.020849"], ["id", 5]]
---
  def update
    @event.update_attributes(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_params
    @event = Event.find(params[:id])