eventro/app/controllers/follows_controller.rb

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
    def destroy
        if @follow.followee_id == @current_user.id
        @follow.destroy

SELECT COUNT(*) FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
---
    def countforfollowees
        @follow = @current_user.followee.count

SELECT COUNT(*) FROM "follows" WHERE "follows"."user_id" = $1  [["user_id", 1]]
---
    def countforfollowers
        @follow = @current_user.follower.count