eventro/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "auth_token", "username", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def create
  @user = User.create!(user_params)

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "na@"], ["password_digest", "$2a$10$8fCJCbd4SVNA6U5PvMPa0.7Flsl1Kh4G5y0DTsyaBhS0FNeH/EdPi"], ["updated_at", "2019-02-03 22:20:25.421390"], ["id", 1]]
---
def update
  if params[:id] == @current_user.id.to_s
  @user.update_attributes(user_params)