app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "TgAuFvd1PD6kxYekLoAkgf72"], ["LIMIT", 1]]
---
  def require_token
    token = params.require(:auth_token)
    @current_user = User.find_by(auth_token: token)

SELECT  "organizers".* FROM "organizers" WHERE "organizers"."auth_token" = $1 LIMIT $2  [["auth_token", "isxsp6d3vutsgV59U2vNiGpF"], ["LIMIT", 1]]
---
  def requireO_token
    token = params.require(:auth_token)
    @current_org = Organizer.find_by(auth_token: token)