app/controllers/follows_controller.rb

INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followee_id", 1], ["created_at", "2019-02-05 13:20:30.331033"], ["updated_at", "2019-02-05 13:20:30.331033"]]
---
    def create
        # @follow = @current_user.followees.create!(follow_params)
        @follow = Follow.create!(follow_params)

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 9]]
---
    def destroy
      if @follow
         if @follow.follower_id == @current_user.id
              @follow.destroy

SELECT COUNT(*) FROM "follows" WHERE "follows"."followee_id" = $1  [["followee_id", 1]]
---
    def countforfollowees
        @follow = @user.followees.count

SELECT COUNT(*) FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 1]]
---
    def countforfollowers
        @follow = @user.followers.count

SELECT  "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."followee_id" = $2 LIMIT $3  [["follower_id", 2], ["followee_id", 1], ["LIMIT", 1]]
---
    def set_follow
        @follow = Follow.find_by({follower_id: @current_user.id, followee_id: params[:user_id]})