app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2019-02-05 09:36:47.576477"], ["updated_at", "2019-02-05 09:36:47.576477"]]
---
  def create
    @like = @current_user.likes.create!(like_params)

DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    if @like
      if @like.user_id == @current_user.id
        @like.destroy

SELECT COUNT(*) FROM "likes" WHERE "likes"."event_id" = $1  [["event_id", 1]]
---
  def count
    @likecount = @event.likes.count

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."event_id" = $2 LIMIT $3  [["user_id", 1], ["event_id", 1], ["LIMIT", 1]]
---
  def set_like
    @event = Event.find(params[:event_id])
    @like = Like.find_by({user_id: @current_user.id, event_id: @event.id})