app/controllers/organizers_controller.rb

SELECT "organizers".* FROM "organizers"
---
    def index
      @organizers = Organizer.all

INSERT INTO "organizers" ("email", "password_digest", "auth_token", "name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @organizer = Organizer.create!(organizer_params)

UPDATE "organizers" SET "password_digest" = $1, "phone" = $2, "updated_at" = $3 WHERE "organizers"."id" = $4  [["password_digest", "$2a$10$eoS5dOccnT1H.E7lU7t4q.OSlYELlDDRcXfVCNkz9v/Cm2Mvl4ikK"], ["phone", "0569336645"], ["updated_at", "2019-02-03 22:53:59.779863"], ["id", 1]]
---
  def update
    if params[:id] == @current_org.id.to_s
      @organizer.update_attributes(organizer_params)

SELECT  "organizers".* FROM "organizers" WHERE "organizers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_organizer
    @organizer = Organizer.find(params[:id])